iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_SADDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DADDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSCR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DSCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTSIZE:16;
      uint64_t SCSIZE:3;
      uint64_t reservedSpace0:1;
      uint64_t DCSIZE:3;
      uint64_t reservedSpace1:1;
      uint64_t SRC_WIDTH:2;
      uint64_t reservedSpace2:2;
      uint64_t DST_WIDTH:2;
      uint64_t reservedSpace3:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SRC_DSCR:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_DSCR:1;
      uint64_t FC:2;
      uint64_t reservedSpace2:1;
      uint64_t SRC_INCR:2;
      uint64_t reservedSpace3:2;
      uint64_t DST_INCR:2;
      uint64_t IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLB4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_PER:4;
      uint64_t DST_PER:4;
      uint64_t reservedSpace0:1;
      uint64_t SRC_H2SEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_H2SEL:1;
      uint64_t reservedSpace2:2;
      uint64_t SOD:1;
      uint64_t reservedSpace3:3;
      uint64_t LOCK_IF:1;
      uint64_t LOCK_B:1;
      uint64_t LOCK_IF_L:1;
      uint64_t reservedSpace4:1;
      uint64_t AHB_PROT:3;
      uint64_t reservedSpace5:1;
      uint64_t FIFOCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CFG4;

  uint8_t res6[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_SADDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DADDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSCR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DSCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTSIZE:16;
      uint64_t SCSIZE:3;
      uint64_t reservedSpace0:1;
      uint64_t DCSIZE:3;
      uint64_t reservedSpace1:1;
      uint64_t SRC_WIDTH:2;
      uint64_t reservedSpace2:2;
      uint64_t DST_WIDTH:2;
      uint64_t reservedSpace3:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SRC_DSCR:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_DSCR:1;
      uint64_t FC:2;
      uint64_t reservedSpace2:1;
      uint64_t SRC_INCR:2;
      uint64_t reservedSpace3:2;
      uint64_t DST_INCR:2;
      uint64_t IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLB5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_PER:4;
      uint64_t DST_PER:4;
      uint64_t reservedSpace0:1;
      uint64_t SRC_H2SEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_H2SEL:1;
      uint64_t reservedSpace2:2;
      uint64_t SOD:1;
      uint64_t reservedSpace3:3;
      uint64_t LOCK_IF:1;
      uint64_t LOCK_B:1;
      uint64_t LOCK_IF_L:1;
      uint64_t reservedSpace4:1;
      uint64_t AHB_PROT:3;
      uint64_t reservedSpace5:1;
      uint64_t FIFOCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CFG5;

  uint8_t res7[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_WPSR;

};

#define DMAC_0 (*(volatile struct DMAC_0_tag *) 0x400c4000)

struct DACC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGEN:1;
      uint64_t TRGSEL:3;
      uint64_t WORD:1;
      uint64_t SLEEP:1;
      uint64_t FASTWKUP:1;
      uint64_t reservedSpace0:1;
      uint64_t REFRESH:8;
      uint64_t USER_SEL:2;
      uint64_t reservedSpace1:2;
      uint64_t TAG:1;
      uint64_t MAXS:1;
      uint64_t reservedSpace2:2;
      uint64_t STARTUP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_MR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CHSR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t EOC:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t EOC:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t EOC:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t EOC:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_ISR;

  uint8_t res2[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBCTLCH0:2;
      uint64_t IBCTLCH1:2;
      uint64_t reservedSpace0:4;
      uint64_t IBCTLDACCORE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_ACR;

  uint8_t res3[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPROTERR:1;
      uint64_t reservedSpace0:7;
      uint64_t WPROTADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_WPSR;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_TCR;

