iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
};

#define HSMCI_1 (*(volatile struct HSMCI_1_tag *) 0x40000000)

struct SSC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t reservedSpace1:5;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_CMR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKS:2;
      uint64_t CKO:3;
      uint64_t CKI:1;
      uint64_t CKG:2;
      uint64_t START:4;
      uint64_t STOP:1;
      uint64_t reservedSpace0:3;
      uint64_t STTDLY:8;
      uint64_t PERIOD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RCMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATLEN:5;
      uint64_t LOOP:1;
      uint64_t reservedSpace0:1;
      uint64_t MSBF:1;
      uint64_t DATNB:4;
      uint64_t reservedSpace1:4;
      uint64_t FSLEN:4;
      uint64_t FSOS:3;
      uint64_t reservedSpace2:1;
      uint64_t FSEDGE:1;
      uint64_t reservedSpace3:3;
      uint64_t FSLEN_EXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RFMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKS:2;
      uint64_t CKO:3;
      uint64_t CKI:1;
      uint64_t CKG:2;
      uint64_t START:4;
      uint64_t reservedSpace0:4;
      uint64_t STTDLY:8;
      uint64_t PERIOD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TCMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATLEN:5;
      uint64_t DATDEF:1;
      uint64_t reservedSpace0:1;
      uint64_t MSBF:1;
      uint64_t DATNB:4;
      uint64_t reservedSpace1:4;
      uint64_t FSLEN:4;
      uint64_t FSOS:3;
      uint64_t FSDEN:1;
      uint64_t FSEDGE:1;
      uint64_t reservedSpace2:3;
      uint64_t FSLEN_EXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TFMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_THR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSDAT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RSHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSDAT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TSHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RC0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RC1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace0:2;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t reservedSpace1:2;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
      uint64_t reservedSpace2:4;
      uint64_t TXEN:1;
      uint64_t RXEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace0:2;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t reservedSpace1:2;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace0:2;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t reservedSpace1:2;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace0:2;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t reservedSpace1:2;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_IMR;

  uint8_t res2[148];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_WPMR;

  uint32_t SSC_WPSR;
};

#define SSC_1 (*(volatile struct SSC_1_tag *) 0x40004000)

struct SPI0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIEN:1;
      uint64_t SPIDIS:1;
      uint64_t reservedSpace0:5;
      uint64_t SWRST:1;
      uint64_t reservedSpace1:16;
      uint64_t LASTXFER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR:1;
      uint64_t PS:1;
      uint64_t PCSDEC:1;
      uint64_t reservedSpace0:1;
      uint64_t MODFDIS:1;
      uint64_t WDRBT:1;
      uint64_t reservedSpace1:1;
      uint64_t LLB:1;
      uint64_t reservedSpace2:8;
      uint64_t PCS:4;
      uint64_t reservedSpace3:4;
      uint64_t DLYBCS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:16;
      uint64_t PCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_RDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD:16;
      uint64_t PCS:4;
      uint64_t reservedSpace0:4;
      uint64_t LASTXFER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_TDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t reservedSpace0:4;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
      uint64_t reservedSpace1:5;
      uint64_t SPIENS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t reservedSpace0:4;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t reservedSpace0:4;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t reservedSpace0:4;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_IMR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_CSR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_CSR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_CSR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_CSR_3;

  uint8_t res1[164];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI0_WPSR;

