iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:2;
      uint64_t reservedSpace0:2;
      uint64_t PRES:3;
      uint64_t reservedSpace1:5;
      uint64_t PLLADIV2:1;
      uint64_t UPLLDIV2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_MCKR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBS:1;
      uint64_t reservedSpace0:7;
      uint64_t USBDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_USB;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:3;
      uint64_t reservedSpace0:1;
      uint64_t PRES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:3;
      uint64_t reservedSpace0:1;
      uint64_t PRES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:3;
      uint64_t reservedSpace0:1;
      uint64_t PRES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCK_2;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:2;
      uint64_t LOCKU:1;
      uint64_t reservedSpace2:1;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t PCKRDY2:1;
      uint64_t reservedSpace3:5;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:2;
      uint64_t LOCKU:1;
      uint64_t reservedSpace2:1;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t PCKRDY2:1;
      uint64_t reservedSpace3:5;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:2;
      uint64_t LOCKU:1;
      uint64_t OSCSELS:1;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t PCKRDY2:1;
      uint64_t reservedSpace2:5;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
      uint64_t CFDS:1;
      uint64_t FOS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:2;
      uint64_t LOCKU:1;
      uint64_t reservedSpace2:1;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t PCKRDY2:1;
      uint64_t reservedSpace3:5;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSTT0:1;
      uint64_t FSTT1:1;
      uint64_t FSTT2:1;
      uint64_t FSTT3:1;
      uint64_t FSTT4:1;
      uint64_t FSTT5:1;
      uint64_t FSTT6:1;
      uint64_t FSTT7:1;
      uint64_t FSTT8:1;
      uint64_t FSTT9:1;
      uint64_t FSTT10:1;
      uint64_t FSTT11:1;
      uint64_t FSTT12:1;
      uint64_t FSTT13:1;
      uint64_t FSTT14:1;
      uint64_t FSTT15:1;
      uint64_t RTTAL:1;
      uint64_t RTCAL:1;
      uint64_t USBAL:1;
      uint64_t reservedSpace0:1;
      uint64_t LPM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_FSMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSTP0:1;
      uint64_t FSTP1:1;
      uint64_t FSTP2:1;
      uint64_t FSTP3:1;
      uint64_t FSTP4:1;
      uint64_t FSTP5:1;
      uint64_t FSTP6:1;
      uint64_t FSTP7:1;
      uint64_t FSTP8:1;
      uint64_t FSTP9:1;
      uint64_t FSTP10:1;
      uint64_t FSTP11:1;
      uint64_t FSTP12:1;
      uint64_t FSTP13:1;
      uint64_t FSTP14:1;
      uint64_t FSTP15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_FSPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FOCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_FOCR;

  uint8_t res5[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_WPSR;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID32:1;
      uint64_t PID33:1;
      uint64_t PID34:1;
      uint64_t PID35:1;
      uint64_t PID36:1;
      uint64_t PID37:1;
      uint64_t PID38:1;
      uint64_t PID39:1;
      uint64_t PID40:1;
      uint64_t PID41:1;
      uint64_t PID42:1;
      uint64_t PID43:1;
      uint64_t PID44:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID32:1;
      uint64_t PID33:1;
      uint64_t PID34:1;
      uint64_t PID35:1;
      uint64_t PID36:1;
      uint64_t PID37:1;
      uint64_t PID38:1;
      uint64_t PID39:1;
      uint64_t PID40:1;
      uint64_t PID41:1;
      uint64_t PID42:1;
      uint64_t PID43:1;
      uint64_t PID44:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID32:1;
      uint64_t PID33:1;
      uint64_t PID34:1;
      uint64_t PID35:1;
      uint64_t PID36:1;
      uint64_t PID37:1;
      uint64_t PID38:1;
      uint64_t PID39:1;
      uint64_t PID40:1;
      uint64_t PID41:1;
      uint64_t PID42:1;
      uint64_t PID43:1;
      uint64_t PID44:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:6;
      uint64_t CMD:1;
      uint64_t reservedSpace1:3;
      uint64_t DIV:2;
      uint64_t reservedSpace2:10;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCR;

