iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR93;

