iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
  uint8_t res1[3848];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPRES:1;
      uint64_t FMT:1;
      uint64_t reservedSpace0:10;
      uint64_t ADDOFF:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_ENTRY0;

  uint32_t DSU_ENTRY1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t END:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_END;

  uint8_t res2[4032];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMEMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_MEMTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEPCC:4;
      uint64_t FKBC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID4;

  uint32_t DSU_PID5;
  uint32_t DSU_PID6;
  uint32_t DSU_PID7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTNBL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTNBH:4;
      uint64_t JEPIDCL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEPIDCH:3;
      uint64_t JEPU:1;
      uint64_t REVISION:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CUSMOD:4;
      uint64_t REVAND:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLEB0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE:4;
      uint64_t CCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLEB2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLEB3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CID3;

};

#define DSU_0 (*(volatile struct DSU_0_tag *) 0x41002000)

struct DSU_EXT_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t reservedSpace0:1;
      uint64_t CRC:1;
      uint64_t MBIST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DSU_CTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DONE:1;
      uint64_t CRSTEXT:1;
      uint64_t BERR:1;
      uint64_t FAIL:1;
      uint64_t PERR:1;
      uint64_t BREXT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DSU_STATUSA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DAL:2;
      uint64_t DBGPRES:1;
      uint64_t HPE:1;
      uint64_t DCCD0:1;
      uint64_t DCCD1:1;
      uint64_t BCCD0:1;
      uint64_t BCCD1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DSU_STATUSB;

  uint8_t DSU_STATUSC;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AMOD:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LENGTH:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DCC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DCC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVSEL:8;
      uint64_t REVISION:4;
      uint64_t DIE:4;
      uint64_t SERIES:6;
      uint64_t reservedSpace0:1;
      uint64_t FAMILY:5;
      uint64_t PROCESSOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LQOS:2;
      uint64_t DCCDMALEVEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_BCC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_BCC_1;

  uint8_t res0[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DCFG_1;

  uint8_t res1[3848];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPRES:1;
      uint64_t FMT:1;
      uint64_t reservedSpace0:10;
      uint64_t ADDOFF:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_ENTRY0;

  uint32_t DSU_ENTRY1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t END:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_END;

  uint8_t res2[4032];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMEMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_MEMTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEPCC:4;
      uint64_t FKBC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID4;

  uint32_t DSU_PID5;
  uint32_t DSU_PID6;
  uint32_t DSU_PID7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTNBL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTNBH:4;
      uint64_t JEPIDCL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEPIDCH:3;
      uint64_t JEPU:1;
      uint64_t REVISION:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CUSMOD:4;
      uint64_t REVAND:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_PID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLEB0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE:4;
      uint64_t CCLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLEB2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLEB3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CID3;

