iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
};

#define EVSYS_0 (*(volatile struct EVSYS_0_tag *) 0x42000000)

struct EVSYS_EVSYS_CHANNEL_0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVGEN:6;
      uint64_t reservedSpace0:2;
      uint64_t PATH:2;
      uint64_t EDGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_CHANNEL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDYUSR:1;
      uint64_t BUSYCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHSTATUS;

};

#define EVSYS_EVSYS_CHANNEL_0_0 (*(volatile struct EVSYS_EVSYS_CHANNEL_0_0_tag *) 0x42000020)

struct EVSYS_EVSYS_CHANNEL_1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVGEN:6;
      uint64_t reservedSpace0:2;
      uint64_t PATH:2;
      uint64_t EDGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_CHANNEL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDYUSR:1;
      uint64_t BUSYCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHSTATUS;

};

#define EVSYS_EVSYS_CHANNEL_1_0 (*(volatile struct EVSYS_EVSYS_CHANNEL_1_0_tag *) 0x42000028)

struct EVSYS_EVSYS_CHANNEL_2_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVGEN:6;
      uint64_t reservedSpace0:2;
      uint64_t PATH:2;
      uint64_t EDGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_CHANNEL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDYUSR:1;
      uint64_t BUSYCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHSTATUS;

};

#define EVSYS_EVSYS_CHANNEL_2_0 (*(volatile struct EVSYS_EVSYS_CHANNEL_2_0_tag *) 0x42000030)

struct EVSYS_EVSYS_CHANNEL_3_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVGEN:6;
      uint64_t reservedSpace0:2;
      uint64_t PATH:2;
      uint64_t EDGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_CHANNEL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDYUSR:1;
      uint64_t BUSYCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHSTATUS;

};

#define EVSYS_EVSYS_CHANNEL_3_0 (*(volatile struct EVSYS_EVSYS_CHANNEL_3_0_tag *) 0x42000038)

struct EVSYS_EVSYS_CHANNEL_4_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVGEN:6;
      uint64_t reservedSpace0:2;
      uint64_t PATH:2;
      uint64_t EDGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_CHANNEL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDYUSR:1;
      uint64_t BUSYCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHSTATUS;

};

#define EVSYS_EVSYS_CHANNEL_4_0 (*(volatile struct EVSYS_EVSYS_CHANNEL_4_0_tag *) 0x42000040)

struct EVSYS_EVSYS_CHANNEL_5_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVGEN:6;
      uint64_t reservedSpace0:2;
      uint64_t PATH:2;
      uint64_t EDGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_CHANNEL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDYUSR:1;
      uint64_t BUSYCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHSTATUS;

