iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
};

#define PORT_IOBUS_PORT_GROUP_0_0 (*(volatile struct PORT_IOBUS_PORT_GROUP_0_0_tag *) 0x60000000)

struct RSTC_2_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t POR:1;
      uint64_t BODCORE:1;
      uint64_t BODVDD:1;
      uint64_t reservedSpace0:1;
      uint64_t EXT:1;
      uint64_t WDT:1;
      uint64_t SYST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RSTC_RCAUSE;

};

#define RSTC_2 (*(volatile struct RSTC_2_tag *) 0x40000c00)

struct RTC_RTC_MODE0_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t MODE:2;
      uint64_t reservedSpace0:3;
      uint64_t MATCHCLR:1;
      uint64_t PRESCALER:4;
      uint64_t reservedSpace1:2;
      uint64_t GPTRST:1;
      uint64_t COUNTSYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_CTRLA;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GP0EN:1;
      uint64_t reservedSpace0:3;
      uint64_t DEBMAJ:1;
      uint64_t DEBASYNC:1;
      uint64_t RTCOUT:1;
      uint64_t DMAEN:1;
      uint64_t DEBF:3;
      uint64_t reservedSpace1:1;
      uint64_t ACTF:3;
      uint64_t SEPTO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_CTRLB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEREO0:1;
      uint64_t PEREO1:1;
      uint64_t PEREO2:1;
      uint64_t PEREO3:1;
      uint64_t PEREO4:1;
      uint64_t PEREO5:1;
      uint64_t PEREO6:1;
      uint64_t PEREO7:1;
      uint64_t CMPEO0:1;
      uint64_t reservedSpace0:5;
      uint64_t TAMPEREO:1;
      uint64_t OVFEO:1;
      uint64_t TAMPEVEI:1;
      uint64_t reservedSpace1:7;
      uint64_t PERDEO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_EVCTRL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PER0:1;
      uint64_t PER1:1;
      uint64_t PER2:1;
      uint64_t PER3:1;
      uint64_t PER4:1;
      uint64_t PER5:1;
      uint64_t PER6:1;
      uint64_t PER7:1;
      uint64_t CMP0:1;
      uint64_t reservedSpace0:5;
      uint64_t TAMPER:1;
      uint64_t OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_INTENCLR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PER0:1;
      uint64_t PER1:1;
      uint64_t PER2:1;
      uint64_t PER3:1;
      uint64_t PER4:1;
      uint64_t PER5:1;
      uint64_t PER6:1;
      uint64_t PER7:1;
      uint64_t CMP0:1;
      uint64_t reservedSpace0:5;
      uint64_t TAMPER:1;
      uint64_t OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_INTENSET;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PER0:1;
      uint64_t PER1:1;
      uint64_t PER2:1;
      uint64_t PER3:1;
      uint64_t PER4:1;
      uint64_t PER5:1;
      uint64_t PER6:1;
      uint64_t PER7:1;
      uint64_t CMP0:1;
      uint64_t reservedSpace0:5;
      uint64_t TAMPER:1;
      uint64_t OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_INTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RTC_DBGCTRL;

  uint8_t res0[1];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t FREQCORR:1;
      uint64_t COUNT:1;
      uint64_t reservedSpace0:1;
      uint64_t COMP0:1;
      uint64_t reservedSpace1:9;
      uint64_t COUNTSYNC:1;
      uint64_t GP0:1;
      uint64_t GP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_SYNCBUSY;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VALUE:7;
      uint64_t SIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RTC_FREQCORR;

  uint8_t res1[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_COUNT;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_COMP_0;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_GP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_GP_1;

  uint8_t res4[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IN0ACT:2;
      uint64_t IN1ACT:2;
      uint64_t IN2ACT:2;
      uint64_t IN3ACT:2;
      uint64_t reservedSpace0:8;
      uint64_t TAMLVL0:1;
      uint64_t TAMLVL1:1;
      uint64_t TAMLVL2:1;
      uint64_t TAMLVL3:1;
      uint64_t reservedSpace1:4;
      uint64_t DEBNC0:1;
      uint64_t DEBNC1:1;
      uint64_t DEBNC2:1;
      uint64_t DEBNC3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TAMPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TIMESTAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMPID0:1;
      uint64_t TAMPID1:1;
      uint64_t TAMPID2:1;
      uint64_t TAMPID3:1;
      uint64_t reservedSpace0:27;
      uint64_t TAMPEVT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TAMPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALSI0:1;
      uint64_t ALSI1:1;
      uint64_t ALSI2:1;
      uint64_t ALSI3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TAMPCTRLB;

};

#define RTC_RTC_MODE0_0 (*(volatile struct RTC_RTC_MODE0_0_tag *) 0x40002400)

struct RTC_RTC_MODE1_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t MODE:2;
      uint64_t reservedSpace0:4;
      uint64_t PRESCALER:4;
      uint64_t reservedSpace1:2;
      uint64_t GPTRST:1;
      uint64_t COUNTSYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_CTRLA;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GP0EN:1;
      uint64_t reservedSpace0:3;
      uint64_t DEBMAJ:1;
      uint64_t DEBASYNC:1;
      uint64_t RTCOUT:1;
      uint64_t DMAEN:1;
      uint64_t DEBF:3;
      uint64_t reservedSpace1:1;
      uint64_t ACTF:3;
      uint64_t SEPTO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_CTRLB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEREO0:1;
      uint64_t PEREO1:1;
      uint64_t PEREO2:1;
      uint64_t PEREO3:1;
      uint64_t PEREO4:1;
      uint64_t PEREO5:1;
      uint64_t PEREO6:1;
      uint64_t PEREO7:1;
      uint64_t CMPEO0:1;
      uint64_t CMPEO1:1;
      uint64_t reservedSpace0:4;
      uint64_t TAMPEREO:1;
      uint64_t OVFEO:1;
      uint64_t TAMPEVEI:1;
      uint64_t reservedSpace1:7;
      uint64_t PERDEO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_EVCTRL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PER0:1;
      uint64_t PER1:1;
      uint64_t PER2:1;
      uint64_t PER3:1;
      uint64_t PER4:1;
      uint64_t PER5:1;
      uint64_t PER6:1;
      uint64_t PER7:1;
      uint64_t CMP0:1;
      uint64_t CMP1:1;
      uint64_t reservedSpace0:4;
      uint64_t TAMPER:1;
      uint64_t OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_INTENCLR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PER0:1;
      uint64_t PER1:1;
      uint64_t PER2:1;
      uint64_t PER3:1;
      uint64_t PER4:1;
      uint64_t PER5:1;
      uint64_t PER6:1;
      uint64_t PER7:1;
      uint64_t CMP0:1;
      uint64_t CMP1:1;
      uint64_t reservedSpace0:4;
      uint64_t TAMPER:1;
      uint64_t OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_INTENSET;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PER0:1;
      uint64_t PER1:1;
      uint64_t PER2:1;
      uint64_t PER3:1;
      uint64_t PER4:1;
      uint64_t PER5:1;
      uint64_t PER6:1;
      uint64_t PER7:1;
      uint64_t CMP0:1;
      uint64_t CMP1:1;
      uint64_t reservedSpace0:4;
      uint64_t TAMPER:1;
      uint64_t OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_INTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RTC_DBGCTRL;

  uint8_t res0[1];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t FREQCORR:1;
      uint64_t COUNT:1;
      uint64_t PER:1;
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t reservedSpace0:8;
      uint64_t COUNTSYNC:1;
      uint64_t GP0:1;
      uint64_t GP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_SYNCBUSY;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VALUE:7;
      uint64_t SIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RTC_FREQCORR;

  uint8_t res1[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_COUNT;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_PER;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_COMP_0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RTC_COMP_1;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_GP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_GP_1;

