iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
};

#define DCB_1 (*(volatile struct DCB_1_tag *) 0xe000edf0)

struct DIB_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLI:1;
      uint64_t SLK:1;
      uint64_t nTT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSID:1;
      uint64_t reservedSpace0:1;
      uint64_t NSNID:1;
      uint64_t reservedSpace1:1;
      uint64_t SID:1;
      uint64_t reservedSpace2:1;
      uint64_t SNID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAUTHSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARCHPART:11;
      uint64_t reservedSpace0:1;
      uint64_t ARCHVER:3;
      uint64_t reservedSpace1:1;
      uint64_t REVISION:3;
      uint64_t reservedSpace2:1;
      uint64_t PRESENT:1;
      uint64_t ARCHITECT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDEVARCH;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAJOR:3;
      uint64_t reservedSpace0:1;
      uint64_t SUB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDEVTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_2:3;
      uint64_t reservedSpace0:1;
      uint64_t SIZE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DPIDR4;

  uint32_t DPIDR5;
  uint32_t DPIDR6;
  uint32_t DPIDR7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PART_0:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DPIDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PART_1:3;
      uint64_t reservedSpace0:1;
      uint64_t DES_0:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DPIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_1:2;
      uint64_t reservedSpace0:1;
      uint64_t JEDEC:1;
      uint64_t REVISION:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DPIDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMOD:3;
      uint64_t reservedSpace0:1;
      uint64_t REVAND:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DPIDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_0:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCIDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_1:3;
      uint64_t reservedSpace0:1;
      uint64_t CLASS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCIDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCIDR3;

};

#define DIB_0 (*(volatile struct DIB_0_tag *) 0xe000efb0)

struct NVIC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER15;

  uint8_t res0[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER15;

  uint8_t res1[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR15;

  uint8_t res2[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR15;

  uint8_t res3[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IABR15;

  uint8_t res4[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ITNS15;

  uint8_t res5[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:7;
      uint64_t reservedSpace0:1;
      uint64_t PRI_N1:7;
      uint64_t reservedSpace1:1;
      uint64_t PRI_N2:7;
      uint64_t reservedSpace2:1;
      uint64_t PRI_N3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR19;

