iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
};

#define NVIC_0 (*(volatile struct NVIC_0_tag *) 0xe000e100)

struct SIG_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STIR;

};

#define SIG_1 (*(volatile struct SIG_1_tag *) 0xe000ef00)

struct SAU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t ALLNS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SREGION:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_RNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t BADDR:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t NSC:1;
      uint64_t reservedSpace0:3;
      uint64_t LADDR:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_RLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVEP:1;
      uint64_t INVIS:1;
      uint64_t INVER:1;
      uint64_t AUVIOL:1;
      uint64_t INVTRAN:1;
      uint64_t LSPERR:1;
      uint64_t SFARVALID:1;
      uint64_t LSERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFAR;

};

#define SAU_1 (*(volatile struct SAU_1_tag *) 0xe000edd0)

struct AC_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_CTRLA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t START0:1;
      uint64_t START1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_CTRLB;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COMPEO0:1;
      uint64_t COMPEO1:1;
      uint64_t reservedSpace0:2;
      uint64_t WINEO0:1;
      uint64_t reservedSpace1:3;
      uint64_t COMPEI0:1;
      uint64_t COMPEI1:1;
      uint64_t reservedSpace2:2;
      uint64_t INVEI0:1;
      uint64_t INVEI1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) AC_EVCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t reservedSpace0:2;
      uint64_t WIN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t reservedSpace0:2;
      uint64_t WIN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_INTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t reservedSpace0:2;
      uint64_t WIN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_INTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t STATE0:1;
      uint64_t STATE1:1;
      uint64_t reservedSpace0:2;
      uint64_t WSTATE0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_STATUSA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t READY0:1;
      uint64_t READY1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_STATUSB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_DBGCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WEN0:1;
      uint64_t WINTSEL0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_WINCTRL;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VALUE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_SCALER_0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VALUE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AC_SCALER_1;

  uint8_t res1[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t SINGLE:1;
      uint64_t INTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace2:1;
      uint64_t MUXNEG:3;
      uint64_t reservedSpace3:1;
      uint64_t MUXPOS:3;
      uint64_t SWAP:1;
      uint64_t SPEED:2;
      uint64_t reservedSpace4:1;
      uint64_t HYSTEN:1;
      uint64_t HYST:2;
      uint64_t reservedSpace5:2;
      uint64_t FLEN:3;
      uint64_t reservedSpace6:1;
      uint64_t OUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC_COMPCTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t SINGLE:1;
      uint64_t INTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace2:1;
      uint64_t MUXNEG:3;
      uint64_t reservedSpace3:1;
      uint64_t MUXPOS:3;
      uint64_t SWAP:1;
      uint64_t SPEED:2;
      uint64_t reservedSpace4:1;
      uint64_t HYSTEN:1;
      uint64_t HYST:2;
      uint64_t reservedSpace5:2;
      uint64_t FLEN:3;
      uint64_t reservedSpace6:1;
      uint64_t OUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC_COMPCTRL_1;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t WINCTRL:1;
      uint64_t COMPCTRL0:1;
      uint64_t COMPCTRL1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC_SYNCBUSY;

};

#define AC_1 (*(volatile struct AC_1_tag *) 0x40003400)

struct ADC_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:3;
      uint64_t SLAVEEN:1;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_CTRLA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRESCALER:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_CTRLB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t REFSEL:4;
      uint64_t reservedSpace0:3;
      uint64_t REFCOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_REFCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FLUSHEI:1;
      uint64_t STARTEI:1;
      uint64_t FLUSHINV:1;
      uint64_t STARTINV:1;
      uint64_t RESRDYEO:1;
      uint64_t WINMONEO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_EVCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESRDY:1;
      uint64_t OVERRUN:1;
      uint64_t WINMON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESRDY:1;
      uint64_t OVERRUN:1;
      uint64_t WINMON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_INTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESRDY:1;
      uint64_t OVERRUN:1;
      uint64_t WINMON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_INTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SEQSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SEQBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_SEQSTATUS;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MUXPOS:5;
      uint64_t reservedSpace0:3;
      uint64_t MUXNEG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADC_INPUTCTRL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIFFMODE:1;
      uint64_t LEFTADJ:1;
      uint64_t FREERUN:1;
      uint64_t CORREN:1;
      uint64_t RESSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t R2R:1;
      uint64_t WINMODE:3;
      uint64_t reservedSpace1:1;
      uint64_t DUALSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADC_CTRLC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SAMPLENUM:4;
      uint64_t ADJRES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_AVGCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SAMPLEN:6;
      uint64_t reservedSpace0:1;
      uint64_t OFFCOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_SAMPCTRL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WINLT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADC_WINLT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WINUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADC_WINUT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GAINCORR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADC_GAINCORR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OFFSETCORR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADC_OFFSETCORR;

  uint8_t res0[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FLUSH:1;
      uint64_t START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_SWTRIG;

  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC_DBGCTRL;

  uint8_t res2[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t INPUTCTRL:1;
      uint64_t CTRLC:1;
      uint64_t AVGCTRL:1;
      uint64_t SAMPCTRL:1;
      uint64_t WINLT:1;
      uint64_t WINUT:1;
      uint64_t GAINCORR:1;
      uint64_t OFFSETCORR:1;
      uint64_t SWTRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADC_SYNCBUSY;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RESULT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADC_RESULT;

  uint8_t res4[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEQEN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_SEQCTRL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BIASCOMP:3;
      uint64_t reservedSpace0:5;
      uint64_t BIASREFBUF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADC_CALIB;

