iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
};

#define MCLK_1 (*(volatile struct MCLK_1_tag *) 0x40000800)

struct NVMCTRL_1_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMD:7;
      uint64_t reservedSpace0:1;
      uint64_t CMDEX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NVMCTRL_CTRLA;

  uint8_t res0[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RWS:4;
      uint64_t reservedSpace1:3;
      uint64_t SLEEPPRM:2;
      uint64_t reservedSpace2:1;
      uint64_t FWUP:1;
      uint64_t reservedSpace3:4;
      uint64_t READMODE:2;
      uint64_t CACHEDIS:1;
      uint64_t QWEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVMCTRL_CTRLB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MANW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVMCTRL_CTRLC;

  uint8_t res1[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AUTOWEI:1;
      uint64_t AUTOWINV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVMCTRL_EVCTRL;

  uint8_t res2[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DONE:1;
      uint64_t PROGE:1;
      uint64_t LOCKE:1;
      uint64_t NVME:1;
      uint64_t KEYE:1;
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVMCTRL_INTENCLR;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DONE:1;
      uint64_t PROGE:1;
      uint64_t LOCKE:1;
      uint64_t NVME:1;
      uint64_t KEYE:1;
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVMCTRL_INTENSET;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DONE:1;
      uint64_t PROGE:1;
      uint64_t LOCKE:1;
      uint64_t NVME:1;
      uint64_t KEYE:1;
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVMCTRL_INTFLAG;

  uint8_t res5[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRM:1;
      uint64_t LOAD:1;
      uint64_t READY:1;
      uint64_t DALFUSE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NVMCTRL_STATUS;

  uint8_t res6[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AOFFSET:16;
      uint64_t reservedSpace0:6;
      uint64_t ARRAY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVMCTRL_ADDR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BS:1;
      uint64_t AS:1;
      uint64_t DS:1;
      uint64_t reservedSpace0:5;
      uint64_t SLKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NVMCTRL_SULCK;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BNS:1;
      uint64_t ANS:1;
      uint64_t DNS:1;
      uint64_t reservedSpace0:5;
      uint64_t NSLKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NVMCTRL_NSULCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASHP:16;
      uint64_t PSZ:3;
      uint64_t reservedSpace0:1;
      uint64_t DFLASHP:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVMCTRL_PARAM;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSCKEY:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVMCTRL_DSCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMPEEN:1;
      uint64_t reservedSpace0:1;
      uint64_t SILACC:1;
      uint64_t DSCEN:1;
      uint64_t reservedSpace1:2;
      uint64_t DXN:1;
      uint64_t reservedSpace2:1;
      uint64_t TEROW:3;
      uint64_t reservedSpace3:13;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVMCTRL_SECCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCREN:1;
      uint64_t BCWEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVMCTRL_SCFGB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t URWEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVMCTRL_SCFGAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRITE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVMCTRL_NONSEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRITE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVMCTRL_NSCHK;

};

#define NVMCTRL_1 (*(volatile struct NVMCTRL_1_tag *) 0x41004000)

struct OPAMP_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:5;
      uint64_t LPMUX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OPAMP_CTRLA;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t READY0:1;
      uint64_t READY1:1;
      uint64_t READY2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OPAMP_STATUS;

  uint8_t res1[1];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t ANAOUT:1;
      uint64_t BIAS:2;
      uint64_t RES2VCC:1;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
      uint64_t RES2OUT:1;
      uint64_t RES1EN:1;
      uint64_t RES1MUX:3;
      uint64_t POTMUX:3;
      uint64_t MUXPOS:4;
      uint64_t MUXNEG:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPAMP_OPAMPCTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t ANAOUT:1;
      uint64_t BIAS:2;
      uint64_t RES2VCC:1;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
      uint64_t RES2OUT:1;
      uint64_t RES1EN:1;
      uint64_t RES1MUX:3;
      uint64_t POTMUX:3;
      uint64_t MUXPOS:4;
      uint64_t MUXNEG:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPAMP_OPAMPCTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t ANAOUT:1;
      uint64_t BIAS:2;
      uint64_t RES2VCC:1;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
      uint64_t RES2OUT:1;
      uint64_t RES1EN:1;
      uint64_t RES1MUX:3;
      uint64_t POTMUX:3;
      uint64_t MUXPOS:4;
      uint64_t MUXNEG:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPAMP_OPAMPCTRL_2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RES2OUT:1;
      uint64_t RES1EN:1;
      uint64_t RES1MUX:1;
      uint64_t POTMUX:3;
      uint64_t REFBUFLEVEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OPAMP_RESCTRL;

