iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC_PERBUF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC_CCBUF_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC_CCBUF_1;

};

#define TC0_TC_COUNT32_1 (*(volatile struct TC0_TC_COUNT32_1_tag *) 0x42001000)

struct TC1_TC_COUNT8_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t MODE:2;
      uint64_t PRESCSYNC:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
      uint64_t PRESCALER:3;
      uint64_t ALOCK:1;
      uint64_t reservedSpace0:4;
      uint64_t CAPTEN0:1;
      uint64_t CAPTEN1:1;
      uint64_t reservedSpace1:2;
      uint64_t COPEN0:1;
      uint64_t COPEN1:1;
      uint64_t reservedSpace2:2;
      uint64_t CAPTMODE0:2;
      uint64_t reservedSpace3:1;
      uint64_t CAPTMODE1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC_CTRLA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DIR:1;
      uint64_t LUPD:1;
      uint64_t ONESHOT:1;
      uint64_t reservedSpace0:2;
      uint64_t CMD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_CTRLBCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DIR:1;
      uint64_t LUPD:1;
      uint64_t ONESHOT:1;
      uint64_t reservedSpace0:2;
      uint64_t CMD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_CTRLBSET;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t EVACT:3;
      uint64_t reservedSpace0:1;
      uint64_t TCINV:1;
      uint64_t TCEI:1;
      uint64_t reservedSpace1:2;
      uint64_t OVFEO:1;
      uint64_t reservedSpace2:3;
      uint64_t MCEO0:1;
      uint64_t MCEO1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TC_EVCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVF:1;
      uint64_t ERR:1;
      uint64_t reservedSpace0:2;
      uint64_t MC0:1;
      uint64_t MC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVF:1;
      uint64_t ERR:1;
      uint64_t reservedSpace0:2;
      uint64_t MC0:1;
      uint64_t MC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_INTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVF:1;
      uint64_t ERR:1;
      uint64_t reservedSpace0:2;
      uint64_t MC0:1;
      uint64_t MC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_INTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t STOP:1;
      uint64_t SLAVE:1;
      uint64_t reservedSpace0:1;
      uint64_t PERBUFV:1;
      uint64_t CCBUFV0:1;
      uint64_t CCBUFV1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WAVEGEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_WAVE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INVEN0:1;
      uint64_t INVEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_DRVCTRL;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_DBGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t CTRLB:1;
      uint64_t STATUS:1;
      uint64_t COUNT:1;
      uint64_t PER:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC_SYNCBUSY;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_COUNT;

  uint8_t res1[6];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_PER;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_CC_0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_CC_1;

  uint8_t res2[17];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PERBUF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_PERBUF;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCBUF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_CCBUF_0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCBUF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_CCBUF_1;

};

#define TC1_TC_COUNT8_1 (*(volatile struct TC1_TC_COUNT8_1_tag *) 0x42001400)

struct TC1_TC_COUNT16_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t MODE:2;
      uint64_t PRESCSYNC:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
      uint64_t PRESCALER:3;
      uint64_t ALOCK:1;
      uint64_t reservedSpace0:4;
      uint64_t CAPTEN0:1;
      uint64_t CAPTEN1:1;
      uint64_t reservedSpace1:2;
      uint64_t COPEN0:1;
      uint64_t COPEN1:1;
      uint64_t reservedSpace2:2;
      uint64_t CAPTMODE0:2;
      uint64_t reservedSpace3:1;
      uint64_t CAPTMODE1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC_CTRLA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DIR:1;
      uint64_t LUPD:1;
      uint64_t ONESHOT:1;
      uint64_t reservedSpace0:2;
      uint64_t CMD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_CTRLBCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DIR:1;
      uint64_t LUPD:1;
      uint64_t ONESHOT:1;
      uint64_t reservedSpace0:2;
      uint64_t CMD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_CTRLBSET;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t EVACT:3;
      uint64_t reservedSpace0:1;
      uint64_t TCINV:1;
      uint64_t TCEI:1;
      uint64_t reservedSpace1:2;
      uint64_t OVFEO:1;
      uint64_t reservedSpace2:3;
      uint64_t MCEO0:1;
      uint64_t MCEO1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TC_EVCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVF:1;
      uint64_t ERR:1;
      uint64_t reservedSpace0:2;
      uint64_t MC0:1;
      uint64_t MC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVF:1;
      uint64_t ERR:1;
      uint64_t reservedSpace0:2;
      uint64_t MC0:1;
      uint64_t MC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_INTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVF:1;
      uint64_t ERR:1;
      uint64_t reservedSpace0:2;
      uint64_t MC0:1;
      uint64_t MC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_INTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t STOP:1;
      uint64_t SLAVE:1;
      uint64_t reservedSpace0:1;
      uint64_t PERBUFV:1;
      uint64_t CCBUFV0:1;
      uint64_t CCBUFV1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WAVEGEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_WAVE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INVEN0:1;
      uint64_t INVEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_DRVCTRL;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TC_DBGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t CTRLB:1;
      uint64_t STATUS:1;
      uint64_t COUNT:1;
      uint64_t PER:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC_SYNCBUSY;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TC_COUNT;

