iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
  uint8_t res12[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t CPOLUP:1;
      uint64_t reservedSpace1:3;
      uint64_t CPOLINVUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMUPD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEDGV:24;
      uint64_t ADEDGM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CAE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEDGVUP:24;
      uint64_t ADEDGMUP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CAEUPD3;

};

#define PWM_1 (*(volatile struct PWM_1_tag *) 0x40000000)

struct AES_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t reservedSpace0:7;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIPHER:1;
      uint64_t reservedSpace0:2;
      uint64_t DUALBUFF:1;
      uint64_t PROCDLY:4;
      uint64_t SMOD:2;
      uint64_t KEYSIZE:2;
      uint64_t OPMOD:3;
      uint64_t LOD:1;
      uint64_t CFBS:3;
      uint64_t reservedSpace1:1;
      uint64_t CKEY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_MR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
      uint64_t reservedSpace1:3;
      uint64_t URAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_KEYWR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_KEYWR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_KEYWR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_KEYWR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_KEYWR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_KEYWR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_KEYWR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_KEYWR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IDATAR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IDATAR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IDATAR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IDATAR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ODATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_ODATAR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ODATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_ODATAR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ODATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_ODATAR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ODATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_ODATAR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IVR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IVR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IVR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_IVR_3;

};

#define AES (*(volatile struct AES_tag *) 0x40004000)

struct CAN0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CANEN:1;
      uint64_t LPM:1;
      uint64_t ABM:1;
      uint64_t OVL:1;
      uint64_t TEOF:1;
      uint64_t TTM:1;
      uint64_t TIMFRZ:1;
      uint64_t DRPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
      uint64_t RBSY:1;
      uint64_t TBSY:1;
      uint64_t OVLSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHASE2:3;
      uint64_t reservedSpace0:1;
      uint64_t PHASE1:3;
      uint64_t reservedSpace1:1;
      uint64_t PROPAG:3;
      uint64_t reservedSpace2:1;
      uint64_t SJW:2;
      uint64_t reservedSpace3:2;
      uint64_t BRP:7;
      uint64_t reservedSpace4:1;
      uint64_t SMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_BR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_TIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_TIMESTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t reservedSpace0:8;
      uint64_t TEC:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:23;
      uint64_t TIMRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ACR;

  uint8_t res0[184];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WPSR;

  uint8_t res1[276];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MAM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MFID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDH0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MAM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MFID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MAM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MFID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MAM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MFID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MMR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MAM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MFID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDH4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MMR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MAM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MFID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MSR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDH5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MMR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MAM6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MFID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MSR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDH6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MMR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MAM7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MFID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MDH7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MCR7;

