iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
};

#define CAN0_1 (*(volatile struct CAN0_1_tag *) 0x40010000)

struct CAN1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CANEN:1;
      uint64_t LPM:1;
      uint64_t ABM:1;
      uint64_t OVL:1;
      uint64_t TEOF:1;
      uint64_t TTM:1;
      uint64_t TIMFRZ:1;
      uint64_t DRPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
      uint64_t RBSY:1;
      uint64_t TBSY:1;
      uint64_t OVLSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHASE2:3;
      uint64_t reservedSpace0:1;
      uint64_t PHASE1:3;
      uint64_t reservedSpace1:1;
      uint64_t PROPAG:3;
      uint64_t reservedSpace2:1;
      uint64_t SJW:2;
      uint64_t reservedSpace3:2;
      uint64_t BRP:7;
      uint64_t reservedSpace4:1;
      uint64_t SMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_BR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_TIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_TIMESTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t reservedSpace0:8;
      uint64_t TEC:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_ECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:23;
      uint64_t TIMRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_ACR;

  uint8_t res0[184];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_WPSR;

  uint8_t res1[276];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MAM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MFID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDH0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MAM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MFID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MAM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MFID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MAM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MFID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MMR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MAM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MFID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDH4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MMR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MAM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MFID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MSR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDH5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MMR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MAM6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MFID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MSR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDH6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMEMARK:16;
      uint64_t PRIOR:4;
      uint64_t reservedSpace0:4;
      uint64_t MOT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MMR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MAM7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDvB:18;
      uint64_t MIDvA:11;
      uint64_t MIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MFID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace0:1;
      uint64_t MABT:1;
      uint64_t MRDY:1;
      uint64_t MMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MDH7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MDLC:4;
      uint64_t MRTR:1;
      uint64_t reservedSpace1:1;
      uint64_t MACR:1;
      uint64_t MTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_MCR7;

