iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
};

#define CAN1_1 (*(volatile struct CAN1_1_tag *) 0x40014000)

struct GMAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LBL:1;
      uint64_t RXEN:1;
      uint64_t TXEN:1;
      uint64_t MPE:1;
      uint64_t CLRSTAT:1;
      uint64_t INCSTAT:1;
      uint64_t WESTAT:1;
      uint64_t BP:1;
      uint64_t TSTART:1;
      uint64_t THALT:1;
      uint64_t TXPF:1;
      uint64_t TXZQPF:1;
      uint64_t reservedSpace1:1;
      uint64_t RDS:1;
      uint64_t SRTSM:1;
      uint64_t ENPBPR:1;
      uint64_t TXPBPF:1;
      uint64_t FNP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPD:1;
      uint64_t FD:1;
      uint64_t DNVLAN:1;
      uint64_t JFRAME:1;
      uint64_t CAF:1;
      uint64_t NBC:1;
      uint64_t MTIHEN:1;
      uint64_t UNIHEN:1;
      uint64_t MAXFS:1;
      uint64_t reservedSpace0:3;
      uint64_t RTY:1;
      uint64_t PEN:1;
      uint64_t RXBUFO:2;
      uint64_t LFERD:1;
      uint64_t RFCS:1;
      uint64_t CLK:3;
      uint64_t DBW:2;
      uint64_t DCPF:1;
      uint64_t RXCOEN:1;
      uint64_t EFRHD:1;
      uint64_t IRXFCS:1;
      uint64_t reservedSpace1:1;
      uint64_t IPGSEN:1;
      uint64_t RXBP:1;
      uint64_t IRXER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_NCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MDIO:1;
      uint64_t IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMIIMII:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_UR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FBLDO:5;
      uint64_t reservedSpace0:1;
      uint64_t ESMA:1;
      uint64_t ESPA:1;
      uint64_t reservedSpace1:3;
      uint64_t TXCOEN:1;
      uint64_t reservedSpace2:4;
      uint64_t DRBS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_DCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UBR:1;
      uint64_t COL:1;
      uint64_t RLE:1;
      uint64_t TXGO:1;
      uint64_t TFC:1;
      uint64_t TXCOMP:1;
      uint64_t UND:1;
      uint64_t reservedSpace0:1;
      uint64_t HRESP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_RBQB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBQB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNA:1;
      uint64_t REC:1;
      uint64_t RXOVR:1;
      uint64_t HNO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_RSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFS:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUR:1;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFNZ:1;
      uint64_t PTZ:1;
      uint64_t PFTR:1;
      uint64_t reservedSpace1:3;
      uint64_t DRQFR:1;
      uint64_t SFR:1;
      uint64_t DRQFT:1;
      uint64_t SFT:1;
      uint64_t PDRQFR:1;
      uint64_t PDRSFR:1;
      uint64_t PDRQFT:1;
      uint64_t PDRSFT:1;
      uint64_t SRI:1;
      uint64_t reservedSpace2:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFS:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUR:1;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFNZ:1;
      uint64_t PTZ:1;
      uint64_t PFTR:1;
      uint64_t EXINT:1;
      uint64_t reservedSpace1:2;
      uint64_t DRQFR:1;
      uint64_t SFR:1;
      uint64_t DRQFT:1;
      uint64_t SFT:1;
      uint64_t PDRQFR:1;
      uint64_t PDRSFR:1;
      uint64_t PDRQFT:1;
      uint64_t PDRSFT:1;
      uint64_t SRI:1;
      uint64_t reservedSpace2:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFS:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUR:1;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFNZ:1;
      uint64_t PTZ:1;
      uint64_t PFTR:1;
      uint64_t EXINT:1;
      uint64_t reservedSpace1:2;
      uint64_t DRQFR:1;
      uint64_t SFR:1;
      uint64_t DRQFT:1;
      uint64_t SFT:1;
      uint64_t PDRQFR:1;
      uint64_t PDRSFR:1;
      uint64_t PDRQFT:1;
      uint64_t PDRSFT:1;
      uint64_t SRI:1;
      uint64_t reservedSpace2:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFS:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUR:1;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFNZ:1;
      uint64_t PTZ:1;
      uint64_t PFTR:1;
      uint64_t EXINT:1;
      uint64_t reservedSpace1:2;
      uint64_t DRQFR:1;
      uint64_t SFR:1;
      uint64_t DRQFT:1;
      uint64_t SFT:1;
      uint64_t PDRQFR:1;
      uint64_t PDRSFR:1;
      uint64_t PDRQFT:1;
      uint64_t PDRSFT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t WTN:2;
      uint64_t REGA:5;
      uint64_t PHYA:5;
      uint64_t OP:2;
      uint64_t CLTTO:1;
      uint64_t WZO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_MAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPQ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_RPQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPQ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TPQ;

