iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t BLKE:1;
      uint64_t DTIP:1;
      uint64_t NOTBUSY:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t SDIOIRQA:1;
      uint64_t reservedSpace0:3;
      uint64_t SDIOWAIT:1;
      uint64_t CSRCV:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t RINDE:1;
      uint64_t RDIRE:1;
      uint64_t RCRCE:1;
      uint64_t RENDE:1;
      uint64_t RTOE:1;
      uint64_t DCRCE:1;
      uint64_t DTOE:1;
      uint64_t CSTOE:1;
      uint64_t reservedSpace1:2;
      uint64_t FIFOEMPTY:1;
      uint64_t XFRDONE:1;
      uint64_t ACKRCV:1;
      uint64_t ACKRCVE:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t BLKE:1;
      uint64_t DTIP:1;
      uint64_t NOTBUSY:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t SDIOIRQA:1;
      uint64_t reservedSpace0:3;
      uint64_t SDIOWAIT:1;
      uint64_t CSRCV:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t RINDE:1;
      uint64_t RDIRE:1;
      uint64_t RCRCE:1;
      uint64_t RENDE:1;
      uint64_t RTOE:1;
      uint64_t DCRCE:1;
      uint64_t DTOE:1;
      uint64_t CSTOE:1;
      uint64_t reservedSpace1:2;
      uint64_t FIFOEMPTY:1;
      uint64_t XFRDONE:1;
      uint64_t ACKRCV:1;
      uint64_t ACKRCVE:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t BLKE:1;
      uint64_t DTIP:1;
      uint64_t NOTBUSY:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t SDIOIRQA:1;
      uint64_t reservedSpace0:3;
      uint64_t SDIOWAIT:1;
      uint64_t CSRCV:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t RINDE:1;
      uint64_t RDIRE:1;
      uint64_t RCRCE:1;
      uint64_t RENDE:1;
      uint64_t RTOE:1;
      uint64_t DCRCE:1;
      uint64_t DTOE:1;
      uint64_t CSTOE:1;
      uint64_t reservedSpace1:2;
      uint64_t FIFOEMPTY:1;
      uint64_t XFRDONE:1;
      uint64_t ACKRCV:1;
      uint64_t ACKRCVE:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t BLKE:1;
      uint64_t DTIP:1;
      uint64_t NOTBUSY:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t SDIOIRQA:1;
      uint64_t reservedSpace0:3;
      uint64_t SDIOWAIT:1;
      uint64_t CSRCV:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t RINDE:1;
      uint64_t RDIRE:1;
      uint64_t RCRCE:1;
      uint64_t RENDE:1;
      uint64_t RTOE:1;
      uint64_t DCRCE:1;
      uint64_t DTOE:1;
      uint64_t CSTOE:1;
      uint64_t reservedSpace1:2;
      uint64_t FIFOEMPTY:1;
      uint64_t XFRDONE:1;
      uint64_t ACKRCV:1;
      uint64_t ACKRCVE:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_IMR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOMODE:1;
      uint64_t reservedSpace0:3;
      uint64_t FERRCTRL:1;
      uint64_t reservedSpace1:3;
      uint64_t HSMODE:1;
      uint64_t reservedSpace2:3;
      uint64_t LSYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_CFG;

  uint8_t res2[140];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_WPSR;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_RNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_PTSR;

  uint8_t res4[216];

  uint32_t HSMCI_FIFO_0;
  uint32_t HSMCI_FIFO_1;
  uint32_t HSMCI_FIFO_2;
  uint32_t HSMCI_FIFO_3;
  uint32_t HSMCI_FIFO_4;
  uint32_t HSMCI_FIFO_5;
  uint32_t HSMCI_FIFO_6;
  uint32_t HSMCI_FIFO_7;
  uint32_t HSMCI_FIFO_8;
  uint32_t HSMCI_FIFO_9;
  uint32_t HSMCI_FIFO_10;
  uint32_t HSMCI_FIFO_11;
  uint32_t HSMCI_FIFO_12;
  uint32_t HSMCI_FIFO_13;
  uint32_t HSMCI_FIFO_14;
  uint32_t HSMCI_FIFO_15;
  uint32_t HSMCI_FIFO_16;
  uint32_t HSMCI_FIFO_17;
  uint32_t HSMCI_FIFO_18;
  uint32_t HSMCI_FIFO_19;
  uint32_t HSMCI_FIFO_20;
  uint32_t HSMCI_FIFO_21;
  uint32_t HSMCI_FIFO_22;
  uint32_t HSMCI_FIFO_23;
  uint32_t HSMCI_FIFO_24;
  uint32_t HSMCI_FIFO_25;
  uint32_t HSMCI_FIFO_26;
  uint32_t HSMCI_FIFO_27;
  uint32_t HSMCI_FIFO_28;
  uint32_t HSMCI_FIFO_29;
  uint32_t HSMCI_FIFO_30;
  uint32_t HSMCI_FIFO_31;
  uint32_t HSMCI_FIFO_32;
  uint32_t HSMCI_FIFO_33;
  uint32_t HSMCI_FIFO_34;
  uint32_t HSMCI_FIFO_35;
  uint32_t HSMCI_FIFO_36;
  uint32_t HSMCI_FIFO_37;
  uint32_t HSMCI_FIFO_38;
  uint32_t HSMCI_FIFO_39;
  uint32_t HSMCI_FIFO_40;
  uint32_t HSMCI_FIFO_41;
  uint32_t HSMCI_FIFO_42;
  uint32_t HSMCI_FIFO_43;
  uint32_t HSMCI_FIFO_44;
  uint32_t HSMCI_FIFO_45;
  uint32_t HSMCI_FIFO_46;
  uint32_t HSMCI_FIFO_47;
  uint32_t HSMCI_FIFO_48;
  uint32_t HSMCI_FIFO_49;
  uint32_t HSMCI_FIFO_50;
  uint32_t HSMCI_FIFO_51;
  uint32_t HSMCI_FIFO_52;
  uint32_t HSMCI_FIFO_53;
  uint32_t HSMCI_FIFO_54;
  uint32_t HSMCI_FIFO_55;
  uint32_t HSMCI_FIFO_56;
  uint32_t HSMCI_FIFO_57;
  uint32_t HSMCI_FIFO_58;
  uint32_t HSMCI_FIFO_59;
  uint32_t HSMCI_FIFO_60;
  uint32_t HSMCI_FIFO_61;
  uint32_t HSMCI_FIFO_62;
  uint32_t HSMCI_FIFO_63;
  uint32_t HSMCI_FIFO_64;
  uint32_t HSMCI_FIFO_65;
  uint32_t HSMCI_FIFO_66;
  uint32_t HSMCI_FIFO_67;
  uint32_t HSMCI_FIFO_68;
  uint32_t HSMCI_FIFO_69;
  uint32_t HSMCI_FIFO_70;
  uint32_t HSMCI_FIFO_71;
  uint32_t HSMCI_FIFO_72;
  uint32_t HSMCI_FIFO_73;
  uint32_t HSMCI_FIFO_74;
  uint32_t HSMCI_FIFO_75;
  uint32_t HSMCI_FIFO_76;
  uint32_t HSMCI_FIFO_77;
  uint32_t HSMCI_FIFO_78;
  uint32_t HSMCI_FIFO_79;
  uint32_t HSMCI_FIFO_80;
  uint32_t HSMCI_FIFO_81;
  uint32_t HSMCI_FIFO_82;
  uint32_t HSMCI_FIFO_83;
  uint32_t HSMCI_FIFO_84;
  uint32_t HSMCI_FIFO_85;
  uint32_t HSMCI_FIFO_86;
  uint32_t HSMCI_FIFO_87;
  uint32_t HSMCI_FIFO_88;
  uint32_t HSMCI_FIFO_89;
  uint32_t HSMCI_FIFO_90;
  uint32_t HSMCI_FIFO_91;
  uint32_t HSMCI_FIFO_92;
  uint32_t HSMCI_FIFO_93;
  uint32_t HSMCI_FIFO_94;
  uint32_t HSMCI_FIFO_95;
  uint32_t HSMCI_FIFO_96;
  uint32_t HSMCI_FIFO_97;
  uint32_t HSMCI_FIFO_98;
  uint32_t HSMCI_FIFO_99;
  uint32_t HSMCI_FIFO_100;
  uint32_t HSMCI_FIFO_101;
  uint32_t HSMCI_FIFO_102;
  uint32_t HSMCI_FIFO_103;
  uint32_t HSMCI_FIFO_104;
  uint32_t HSMCI_FIFO_105;
  uint32_t HSMCI_FIFO_106;
  uint32_t HSMCI_FIFO_107;
  uint32_t HSMCI_FIFO_108;
  uint32_t HSMCI_FIFO_109;
  uint32_t HSMCI_FIFO_110;
  uint32_t HSMCI_FIFO_111;
  uint32_t HSMCI_FIFO_112;
  uint32_t HSMCI_FIFO_113;
  uint32_t HSMCI_FIFO_114;
  uint32_t HSMCI_FIFO_115;
  uint32_t HSMCI_FIFO_116;
  uint32_t HSMCI_FIFO_117;
  uint32_t HSMCI_FIFO_118;
  uint32_t HSMCI_FIFO_119;
  uint32_t HSMCI_FIFO_120;
  uint32_t HSMCI_FIFO_121;
  uint32_t HSMCI_FIFO_122;
  uint32_t HSMCI_FIFO_123;
  uint32_t HSMCI_FIFO_124;
  uint32_t HSMCI_FIFO_125;
  uint32_t HSMCI_FIFO_126;
  uint32_t HSMCI_FIFO_127;
  uint32_t HSMCI_FIFO_128;
  uint32_t HSMCI_FIFO_129;
  uint32_t HSMCI_FIFO_130;
  uint32_t HSMCI_FIFO_131;
  uint32_t HSMCI_FIFO_132;
  uint32_t HSMCI_FIFO_133;
  uint32_t HSMCI_FIFO_134;
  uint32_t HSMCI_FIFO_135;
  uint32_t HSMCI_FIFO_136;
  uint32_t HSMCI_FIFO_137;
  uint32_t HSMCI_FIFO_138;
  uint32_t HSMCI_FIFO_139;
  uint32_t HSMCI_FIFO_140;
  uint32_t HSMCI_FIFO_141;
  uint32_t HSMCI_FIFO_142;
  uint32_t HSMCI_FIFO_143;
  uint32_t HSMCI_FIFO_144;
  uint32_t HSMCI_FIFO_145;
  uint32_t HSMCI_FIFO_146;
  uint32_t HSMCI_FIFO_147;
  uint32_t HSMCI_FIFO_148;
  uint32_t HSMCI_FIFO_149;
  uint32_t HSMCI_FIFO_150;
  uint32_t HSMCI_FIFO_151;
  uint32_t HSMCI_FIFO_152;
  uint32_t HSMCI_FIFO_153;
  uint32_t HSMCI_FIFO_154;
  uint32_t HSMCI_FIFO_155;
  uint32_t HSMCI_FIFO_156;
  uint32_t HSMCI_FIFO_157;
  uint32_t HSMCI_FIFO_158;
  uint32_t HSMCI_FIFO_159;
  uint32_t HSMCI_FIFO_160;
  uint32_t HSMCI_FIFO_161;
  uint32_t HSMCI_FIFO_162;
  uint32_t HSMCI_FIFO_163;
  uint32_t HSMCI_FIFO_164;
  uint32_t HSMCI_FIFO_165;
  uint32_t HSMCI_FIFO_166;
  uint32_t HSMCI_FIFO_167;
  uint32_t HSMCI_FIFO_168;
  uint32_t HSMCI_FIFO_169;
  uint32_t HSMCI_FIFO_170;
  uint32_t HSMCI_FIFO_171;
  uint32_t HSMCI_FIFO_172;
  uint32_t HSMCI_FIFO_173;
  uint32_t HSMCI_FIFO_174;
  uint32_t HSMCI_FIFO_175;
  uint32_t HSMCI_FIFO_176;
  uint32_t HSMCI_FIFO_177;
  uint32_t HSMCI_FIFO_178;
  uint32_t HSMCI_FIFO_179;
  uint32_t HSMCI_FIFO_180;
  uint32_t HSMCI_FIFO_181;
  uint32_t HSMCI_FIFO_182;
  uint32_t HSMCI_FIFO_183;
  uint32_t HSMCI_FIFO_184;
  uint32_t HSMCI_FIFO_185;
  uint32_t HSMCI_FIFO_186;
  uint32_t HSMCI_FIFO_187;
  uint32_t HSMCI_FIFO_188;
  uint32_t HSMCI_FIFO_189;
  uint32_t HSMCI_FIFO_190;
  uint32_t HSMCI_FIFO_191;
  uint32_t HSMCI_FIFO_192;
  uint32_t HSMCI_FIFO_193;
  uint32_t HSMCI_FIFO_194;
  uint32_t HSMCI_FIFO_195;
  uint32_t HSMCI_FIFO_196;
  uint32_t HSMCI_FIFO_197;
  uint32_t HSMCI_FIFO_198;
  uint32_t HSMCI_FIFO_199;
  uint32_t HSMCI_FIFO_200;
  uint32_t HSMCI_FIFO_201;
  uint32_t HSMCI_FIFO_202;
  uint32_t HSMCI_FIFO_203;
  uint32_t HSMCI_FIFO_204;
  uint32_t HSMCI_FIFO_205;
  uint32_t HSMCI_FIFO_206;
  uint32_t HSMCI_FIFO_207;
  uint32_t HSMCI_FIFO_208;
  uint32_t HSMCI_FIFO_209;
  uint32_t HSMCI_FIFO_210;
  uint32_t HSMCI_FIFO_211;
  uint32_t HSMCI_FIFO_212;
  uint32_t HSMCI_FIFO_213;
  uint32_t HSMCI_FIFO_214;
  uint32_t HSMCI_FIFO_215;
  uint32_t HSMCI_FIFO_216;
  uint32_t HSMCI_FIFO_217;
  uint32_t HSMCI_FIFO_218;
  uint32_t HSMCI_FIFO_219;
  uint32_t HSMCI_FIFO_220;
  uint32_t HSMCI_FIFO_221;
  uint32_t HSMCI_FIFO_222;
  uint32_t HSMCI_FIFO_223;
  uint32_t HSMCI_FIFO_224;
  uint32_t HSMCI_FIFO_225;
  uint32_t HSMCI_FIFO_226;
  uint32_t HSMCI_FIFO_227;
  uint32_t HSMCI_FIFO_228;
  uint32_t HSMCI_FIFO_229;
  uint32_t HSMCI_FIFO_230;
  uint32_t HSMCI_FIFO_231;
  uint32_t HSMCI_FIFO_232;
  uint32_t HSMCI_FIFO_233;
  uint32_t HSMCI_FIFO_234;
  uint32_t HSMCI_FIFO_235;
  uint32_t HSMCI_FIFO_236;
  uint32_t HSMCI_FIFO_237;
  uint32_t HSMCI_FIFO_238;
  uint32_t HSMCI_FIFO_239;
  uint32_t HSMCI_FIFO_240;
  uint32_t HSMCI_FIFO_241;
  uint32_t HSMCI_FIFO_242;
  uint32_t HSMCI_FIFO_243;
  uint32_t HSMCI_FIFO_244;
  uint32_t HSMCI_FIFO_245;
  uint32_t HSMCI_FIFO_246;
  uint32_t HSMCI_FIFO_247;
  uint32_t HSMCI_FIFO_248;
  uint32_t HSMCI_FIFO_249;
  uint32_t HSMCI_FIFO_250;
  uint32_t HSMCI_FIFO_251;
  uint32_t HSMCI_FIFO_252;
  uint32_t HSMCI_FIFO_253;
  uint32_t HSMCI_FIFO_254;
  uint32_t HSMCI_FIFO_255;
};

#define HSMCI_1 (*(volatile struct HSMCI_1_tag *) 0x40080000)

struct SPI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIEN:1;
      uint64_t SPIDIS:1;
      uint64_t reservedSpace0:5;
      uint64_t SWRST:1;
      uint64_t reservedSpace1:16;
      uint64_t LASTXFER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR:1;
      uint64_t PS:1;
      uint64_t PCSDEC:1;
      uint64_t reservedSpace0:1;
      uint64_t MODFDIS:1;
      uint64_t WDRBT:1;
      uint64_t reservedSpace1:1;
      uint64_t LLB:1;
      uint64_t reservedSpace2:8;
      uint64_t PCS:4;
      uint64_t reservedSpace3:4;
      uint64_t DLYBCS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:16;
      uint64_t PCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_RDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD:16;
      uint64_t PCS:4;
      uint64_t reservedSpace0:4;
      uint64_t LASTXFER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_TDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
      uint64_t reservedSpace0:5;
      uint64_t SPIENS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_IMR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CSR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CSR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CSR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CSR_3;

  uint8_t res1[164];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_WPSR;

