iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM4E16E/targetInit/SAM4E16E_sfr.h
};

#define RTC_1 (*(volatile struct RTC_1_tag *) 0x400e1860)

struct GPBR_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_19;

};

#define GPBR_1 (*(volatile struct GPBR_1_tag *) 0x400e1890)

struct RSWDT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDRSTT:1;
      uint64_t reservedSpace0:23;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSWDT_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDV:12;
      uint64_t WDFIEN:1;
      uint64_t WDRSTEN:1;
      uint64_t WDRPROC:1;
      uint64_t WDDIS:1;
      uint64_t WDD:12;
      uint64_t WDDBGHLT:1;
      uint64_t WDIDLEHLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSWDT_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDUNF:1;
      uint64_t WDERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSWDT_SR;

};

#define RSWDT (*(volatile struct RSWDT_tag *) 0x400e1900)

